import random

def NewList():
    num = int(input('Введите число элементов: '))
    newlist = []
    for el in range(num):
        newlist.append(random.randrange(10))
    return newlist

task = int(input('Введите номер задачи: '))
print('#################################################################################')

#Задача 1
# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

if task == 1:
    print('Программа ищет сумму элементов списка, стоящих на нечётной позиции.')
    print('#################################################################################')
    newlist = NewList()
    sum = 0
    print(newlist)
    for i in range(1,len(newlist),2):
        sum += newlist[i]
    print(f'Сумма элементов равна: {sum}')

#######################################################

#Задача 2
# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

elif task == 2:
    print('Программа ищет произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.')
    print('#################################################################################')
    newlist = NewList()
    res = []
    print(newlist)
    if len(newlist)%2 == 0:
        for i in range(len(newlist)//2):
            res.append(newlist[i] * newlist[len(newlist) - 1 - i])
    else:
        for i in range(len(newlist)//2 + 1):
            res.append(newlist[i] * newlist[len(newlist) - 1 - i])
    print(res)


########################################################3

#Задача 3
# Задайте список из вещественных чисел. 
# Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

elif task == 3:
    print('Программа ищет разницу между максимальным и минимальным значением дробной части элементов.')
    print('#################################################################################')
    num = int(input('Введите число элементов: '))
    newlist = []
    res = []
    for el in range(num):
        newlist.append(round(random.uniform(0, 10), 2))
    print(newlist)
    for i in range(len(newlist)):
        res.append(int((newlist[i] * 100) % 100))
    for j in range(len(res)):
        for i in range(len(res) - 1):
            if res[i + 1] < res[i]: 
                temp = res[i]
                res[i] = res[i + 1]
                res[i + 1] = temp
    res = [el / 100 for el in res]
    for el in res:
        if el == 0:
            res.remove(el)
    print(f'Разница между минимальным {res[0]} и максимальным {res[len(res) - 1]} равна: {round(((res[len(res) - 1] - res[0])), 2)}')


########################################################3

#Задача 4
# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

elif task == 4:
    print('Программа преобразует десятичное число в двоичное.')
    print('#################################################################################')
    num = int(input('Введите число: '))
    res = []
    while num != 0:
        res.append(num - num//2 * 2)
        num = num // 2
    res = res [:: -1]
    print(*res)

########################################################3

#Задача 5
#Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]

elif task == 5:


    def Fibu(num):
        if num == 0:
            newlist = [0]
        elif num == 1:
            newlist = [1, 0, 1]
        else:
            newlist1 = [0, 1]   
            for i in range(2, num + 1):
                newlist1.append(newlist1[i - 1] + newlist1[i - 2])
            newlist2 = [0, 1]
            for i in range(2, num + 1):
                newlist2.append(newlist2[i - 2] - newlist2[i - 1])
            newlist2 = newlist2[:0: -1]
            newlist = newlist2 + newlist1
        return newlist


    print('Программа задает список чисел Фибоначчи, в том числе для отрицательных индексов.')
    print('#################################################################################')
    num = int(input('Введите число: '))
    newlist = Fibu(num)
    print(newlist)

########################3

else:
    print('Такой задачи нет!')

